gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Hardware/NET/net_nbiot_app.c
	/* COAP SHORT STATUS DATA ENQUEUE */
#if NBCOAP_SENDCODE_SHORT_STATUS
	if (NETCoapNeedSendCode.ShortStatus) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CoapShortStructureInit();
		CoapShortStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_SHORT_STATUS;
		CoapShortStructure.DateTime						= SpotStatusData.unixTime;
		CoapShortStructure.SpotStatus						= SpotStatusData.spot_status;
		CoapShortStructure.SpotCount						= SpotStatusData.spot_count;
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapShortStructure, sizeof(CoapShortStructure));
		NETCoapNeedSendCode.ShortStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
	/* COAP LONG STATUS DATA ENQUEUE */
#if NBCOAP_SENDCODE_LONG_STATUS
	if (NETCoapNeedSendCode.LongStatus) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CoapLongStructureInit();
		CoapLongStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_LONG_STATUS;
		CoapLongStructure.DateTime						= SpotStatusData.unixTime;
		CoapLongStructure.SpotStatus						= SpotStatusData.spot_status;
		CoapLongStructure.SpotCount						= SpotStatusData.spot_count;
		CoapLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		CoapLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		CoapLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		CoapLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		CoapLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		CoapLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		CoapLongStructure.RadarCoverCount					= SpotStatusData.radarData.Diff_v2;
		CoapLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if NBIOT_STATUS_MSG_VERSION_TYPE == NBIOT_STATUS_MSG_VERSION_77BYTE_V2
		CoapLongStructure.NBRssi							= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		CoapLongStructure.NBSnr							= TCFG_Utility_Get_Nbiot_RadioSNR();
		CoapLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		CoapLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		CoapLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		CoapLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		CoapLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		CoapLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			CoapLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			CoapLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapLongStructure, sizeof(CoapLongStructure));
		NETCoapNeedSendCode.LongStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
	/* COAP WORK INFO DATA ENQUEUE */
#if NBCOAP_SENDCODE_WORK_INFO
	if (NETCoapNeedSendCode.WorkInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_WORK_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Work_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.WorkInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
	/* COAP BASIC INFO DATA ENQUEUE */
#if NBCOAP_SENDCODE_BASIC_INFO
	if (NETCoapNeedSendCode.BasicInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Basic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.BasicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
	/* COAP DYNAMIC INFO DATA ENQUEUE */
#if NBCOAP_SENDCODE_DYNAMIC_INFO
	if (NETCoapNeedSendCode.DynamicInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Dynamic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
	/* COAP RESPONSE INFO DATA ENQUEUE */
#if NBCOAP_SENDCODE_RESPONSE_INFO
	if (NETCoapNeedSendCode.ResponseInfo) {
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Response_Info((char *)&CoapInfoStructure.InfoData, NETCoapNeedSendCode.ResponseInfoErrcode, NETCoapNeedSendCode.ResponseInfoMsgId);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.ResponseInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
	}
#endif
	
#elif NETPROTOCAL == NETMQTTSN
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBMQTTSN_SENDCODE_STATUS_EXTEND
		NETMqttSNNeedSendCode.StatusExtend = 1;
	#endif
	}
	
	/* MQTTSN SHORT STATUS DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_STATUS_BASIC
	if (NETMqttSNNeedSendCode.StatusBasic) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_MqttSNShortStructureInit();
		MqttSNShortStructure.MsgPacket.Type				= MQTTSN_MSGTYPE_TYPE_SHORT_STATUS;
		MqttSNShortStructure.DateTime						= SpotStatusData.unixTime;
		MqttSNShortStructure.SpotStatus					= SpotStatusData.spot_status;
		MqttSNShortStructure.SpotCount					= SpotStatusData.spot_count;
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNShortStructure, sizeof(MqttSNShortStructure));
		NETMqttSNNeedSendCode.StatusBasic = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
