gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Hardware/NET/net_nbiot_app.c
	/* MQTTSN LONG STATUS DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_STATUS_EXTEND
	if (NETMqttSNNeedSendCode.StatusExtend) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_MqttSNLongStructureInit();
		MqttSNLongStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_LONG_STATUS;
		MqttSNLongStructure.DateTime						= SpotStatusData.unixTime;
		MqttSNLongStructure.SpotStatus					= SpotStatusData.spot_status;
		MqttSNLongStructure.SpotCount						= SpotStatusData.spot_count;
		MqttSNLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		MqttSNLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		MqttSNLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		MqttSNLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		MqttSNLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		MqttSNLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		MqttSNLongStructure.RadarCoverCount				= SpotStatusData.radarData.Diff_v2;
		MqttSNLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
		MqttSNLongStructure.NBRssi						= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		MqttSNLongStructure.NBSnr						= TCFG_Utility_Get_Nbiot_RadioSNR();
		MqttSNLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		MqttSNLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		MqttSNLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		MqttSNLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		MqttSNLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		MqttSNLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			MqttSNLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			MqttSNLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNLongStructure, sizeof(MqttSNLongStructure));
		NETMqttSNNeedSendCode.StatusExtend = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
	/* MQTTSN INFO WORK DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_WORK_INFO
	if (NETMqttSNNeedSendCode.InfoWork) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_WORK_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Work_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoWork = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
	/* MQTTSN INFO BASIC DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_BASIC_INFO
	if (NETMqttSNNeedSendCode.InfoBasic) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Basic_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoBasic = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
	/* MQTTSN INFO DYNAMIC DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_DYNAMIC_INFO
	if (NETMqttSNNeedSendCode.InfoDynamic) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Dynamic_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoDynamic = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
	/* MQTTSN INFO RESPONSE DATA ENQUEUE */
#if NBMQTTSN_SENDCODE_RESPONSE_INFO
	if (NETMqttSNNeedSendCode.InfoResponse) {
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Response_Info((char *)&MqttSNInfoStructure.InfoData, NETMqttSNNeedSendCode.InfoResponseErrcode, NETMqttSNNeedSendCode.InfoResponseMsgId);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoResponse = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
	}
#endif
	
#elif NETPROTOCAL == NETONENET
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBONENET_SENDCODE_LONG_STATUS
		NETOneNETNeedSendCode.LongStatus = 1;
	#endif
	}
	
	/* ONENET SHORT STATUS DATA ENQUEUE */
#if NBONENET_SENDCODE_SHORT_STATUS
	if (NETOneNETNeedSendCode.ShortStatus) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_OneNETShortStructureInit();
		OneNETShortStructure.MsgPacket.Type				= ONENET_MSGTYPE_TYPE_SHORT_STATUS;
		OneNETShortStructure.DateTime						= SpotStatusData.unixTime;
		OneNETShortStructure.SpotStatus					= SpotStatusData.spot_status;
		OneNETShortStructure.SpotCount					= SpotStatusData.spot_count;
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETShortStructure, sizeof(OneNETShortStructure));
		NETOneNETNeedSendCode.ShortStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_OneNETSentDataAfterExexution();
	}
#endif
	
	/* ONENET LONG STATUS DATA ENQUEUE */
#if NBONENET_SENDCODE_LONG_STATUS
	if (NETOneNETNeedSendCode.LongStatus) {
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_OneNETLongStructureInit();
		OneNETLongStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_LONG_STATUS;
		OneNETLongStructure.DateTime						= SpotStatusData.unixTime;
		OneNETLongStructure.SpotStatus					= SpotStatusData.spot_status;
		OneNETLongStructure.SpotCount						= SpotStatusData.spot_count;
		OneNETLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		OneNETLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		OneNETLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		OneNETLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		OneNETLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		OneNETLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		OneNETLongStructure.RadarCoverCount				= SpotStatusData.radarData.Diff_v2;
		OneNETLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_77BYTE_V2
		OneNETLongStructure.NBRssi						= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		OneNETLongStructure.NBSnr						= TCFG_Utility_Get_Nbiot_RadioSNR();
		OneNETLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		OneNETLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		OneNETLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		OneNETLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		OneNETLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		OneNETLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			OneNETLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			OneNETLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETLongStructure, sizeof(OneNETLongStructure));
		NETOneNETNeedSendCode.LongStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_OneNETSentDataAfterExexution();
	}
#endif
	
	/* ONENET WORK INFO DATA ENQUEUE */
#if NBONENET_SENDCODE_WORK_INFO
	if (NETOneNETNeedSendCode.WorkInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_WORK_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Work_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.WorkInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
	}
#endif
	
	/* ONENET BASIC INFO DATA ENQUEUE */
#if NBONENET_SENDCODE_BASIC_INFO
	if (NETOneNETNeedSendCode.BasicInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Basic_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.BasicInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
	}
#endif
	
	/* ONENET DYNAMIC INFO DATA ENQUEUE */
#if NBONENET_SENDCODE_DYNAMIC_INFO
	if (NETOneNETNeedSendCode.DynamicInfo) {
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Dynamic_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
	}
#endif
	
