gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Hardware/NET/net_nbiot_app.c
		aep_ErrorCode_Event = 0;
	}
	
	if (aep_LowVoltage_Event == 1) {
		AepBytes aepCodeResult;
		
		AepLowVoltageAlarmSrcdata.battery_voltage				= ((float)TCFG_Utility_Get_Device_Batt_ShortVal() / 100.0);
		aepCodeResult = CTWing_CodeDataReportByIdToBytes(&CTWingClientHandler, AEP_SERVICE_ID_LOWVOLTAGE, &AepLowVoltageAlarmSrcdata);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)aepCodeResult.str, aepCodeResult.len);
		
		aep_LowVoltage_Event = 0;
	}
	
	if (aep_MagDisturb_Event == 1) {
		AepBytes aepCodeResult;
		
		AepMagneticDisturbSrcdata.magnetic_value				= (abs(Qmc5883lData.Z_Now) % 1000);
		aepCodeResult = CTWing_CodeDataReportByIdToBytes(&CTWingClientHandler, AEP_SERVICE_ID_MAGNETICDISTURB, &AepMagneticDisturbSrcdata);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)aepCodeResult.str, aepCodeResult.len);
		
		aep_MagDisturb_Event = 0;
	}
#endif

#endif
	
#else
	#error NETPROTOCAL Define Error
#endif
#endif
}

/**********************************************************************************************************
 @Function			void NET_NBIOT_TaskProcessing(NET_NBIOT_ClientsTypeDef* pClient)
 @Description			NET_NBIOT_TaskProcessing						: NET工作处理
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_TaskProcessing(NET_NBIOT_ClientsTypeDef* pClient)
{
#ifndef NETPROTOCAL
	#error No Define NETPROTOCAL!
#else
	/* NBIOT PollExecution */
#if NETPROTOCAL == NETCOAP
	
	switch (pClient->PollExecution)
	{
	case NET_POLL_EXECUTION_COAP:
		NET_COAP_APP_PollExecution(&NbiotClientHandler);
		break;
	
	case NET_POLL_EXECUTION_DNS:
		pClient->PollExecution = NET_POLL_EXECUTION_COAP;
		break;
	
	case NET_POLL_EXECUTION_MQTTSN:
		pClient->PollExecution = NET_POLL_EXECUTION_COAP;
		break;
	
	case NET_POLL_EXECUTION_PCP:
		NET_PCP_APP_PollExecution(&PCPClientHandler);
		break;
	
	case NET_POLL_EXECUTION_ONENET:
		pClient->PollExecution = NET_POLL_EXECUTION_COAP;
		break;
		
	case NET_POLL_EXECUTION_CTWING:
		pClient->PollExecution = NET_POLL_EXECUTION_COAP;
		break;
	}
	
#elif NETPROTOCAL == NETMQTTSN
	
	switch (pClient->PollExecution)
	{
	case NET_POLL_EXECUTION_COAP:
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_DISABLE
		pClient->PollExecution = NET_POLL_EXECUTION_MQTTSN;
#endif
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		pClient->PollExecution = NET_POLL_EXECUTION_DNS;
#endif
		break;
	
	case NET_POLL_EXECUTION_DNS:
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_DISABLE
		pClient->PollExecution = NET_POLL_EXECUTION_MQTTSN;
#endif
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		NET_DNS_APP_PollExecution(&DNSClientHandler);
#endif
		break;
	
	case NET_POLL_EXECUTION_MQTTSN:
		NET_MQTTSN_APP_PollExecution(&MqttSNClientHandler);
		break;
	
	case NET_POLL_EXECUTION_PCP:
		NET_MqttSN_PCP_APP_PollExecution(&MqttSNPCPClientHandler);
		break;
	
	case NET_POLL_EXECUTION_ONENET:
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_DISABLE
		pClient->PollExecution = NET_POLL_EXECUTION_MQTTSN;
#endif
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		pClient->PollExecution = NET_POLL_EXECUTION_DNS;
#endif
		break;
	
	case NET_POLL_EXECUTION_CTWING:
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_DISABLE
		pClient->PollExecution = NET_POLL_EXECUTION_MQTTSN;
#endif
#if MQTTSN_DNS_SERVER_TYPE == MQTTSN_DNS_SERVER_ENABLE
		pClient->PollExecution = NET_POLL_EXECUTION_DNS;
#endif
		break;
	}
	
#elif NETPROTOCAL == NETONENET
	
	switch (pClient->PollExecution)
	{
	case NET_POLL_EXECUTION_COAP:
		pClient->PollExecution = NET_POLL_EXECUTION_ONENET;
		break;
	
	case NET_POLL_EXECUTION_DNS:
		pClient->PollExecution = NET_POLL_EXECUTION_ONENET;
		break;
	
	case NET_POLL_EXECUTION_MQTTSN:
		pClient->PollExecution = NET_POLL_EXECUTION_ONENET;
		break;
	
	case NET_POLL_EXECUTION_PCP:
		pClient->PollExecution = NET_POLL_EXECUTION_ONENET;
		break;
	
	case NET_POLL_EXECUTION_ONENET:
		NET_ONENET_APP_PollExecution(&OneNETClientHandler);
		break;
	
	case NET_POLL_EXECUTION_CTWING:
		pClient->PollExecution = NET_POLL_EXECUTION_ONENET;
		break;
	}
	
#elif NETPROTOCAL == NETCTWING
	
	switch (pClient->PollExecution)
	{
	case NET_POLL_EXECUTION_COAP:
		pClient->PollExecution = NET_POLL_EXECUTION_CTWING;
		break;
	
	case NET_POLL_EXECUTION_DNS:
		pClient->PollExecution = NET_POLL_EXECUTION_CTWING;
		break;
	
	case NET_POLL_EXECUTION_MQTTSN:
		pClient->PollExecution = NET_POLL_EXECUTION_CTWING;
		break;
	
	case NET_POLL_EXECUTION_PCP:
		pClient->PollExecution = NET_POLL_EXECUTION_CTWING;
		break;
	
	case NET_POLL_EXECUTION_ONENET:
		pClient->PollExecution = NET_POLL_EXECUTION_CTWING;
		break;
	
	case NET_POLL_EXECUTION_CTWING:
		NET_CTWING_APP_PollExecution(&CTWingClientHandler);
		break;
	}
	
#else
	#error NETPROTOCAL Define Error
#endif
#endif
}

/**********************************************************************************************************
 @Function			void NET_NBIOT_App_Task(void)
 @Description			NET_NBIOT_App_Task							: NET处理
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_App_Task(void)
{
	NET_NBIOT_DataProcessing(&NetNbiotClientHandler);							//数据处理
	
	NET_NBIOT_TaskProcessing(&NetNbiotClientHandler);							//工作处理
}

/**********************************************************************************************************
 @Function			void NET_NBIOT_BackupCurrentApp_Task(void)
 @Description			NET_NBIOT_BackupCurrentApp_Task				: NET备份固件
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_BackupCurrentApp_Task(void)
{
#ifndef NETPROTOCAL
	#error No Define NETPROTOCAL!
#else
#if (NETPROTOCAL == NETCOAP)
	
	PCP_Upgrade_BackupCurrentAPP(&PCPClientHandler);
	
#elif (NETPROTOCAL == NETMQTTSN)
	
	MqttPCP_Upgrade_BackupCurrentAPP(&MqttSNPCPClientHandler);
	
#elif (NETPROTOCAL == NETONENET)
	
	//Todo
	
#elif (NETPROTOCAL == NETCTWING)
	
	//Todo
	
#else
	#error NETPROTOCAL Define Error
#endif
#endif
}

/********************************************** END OF FLEE **********************************************/
